; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	thermograph3 - mode
	image1 - mode
	thermograph2 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star10 - direction
	Star9 - direction
	Star2 - direction
	GroundStation4 - direction
	Star0 - direction
	Star6 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Star16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star10)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star17)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star9)
	(supports instrument2 image1)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet15)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument4 thermograph3)
	(supports instrument4 image1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star2)
	(supports instrument5 image1)
	(calibration_target instrument5 Star11)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(pointing satellite0 Planet13)
	(pointing satellite3 GroundStation8)
	(have_image Planet12 thermograph0)
	(have_image Planet13 thermograph3)
	(have_image Planet14 image1)
	(have_image Planet15 thermograph3)
	(have_image Star16 thermograph0)
	(have_image Star17 thermograph0)
	(have_image Planet18 image1)
))

)

; plan
1. (turn_to satellite1 star9 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star9)
   goals met: 0 of 9
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite1 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite1 planet13 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet13)
   goals met: 0 of 9
5. (turn_to satellite0 star10 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star10)
   goals met: 0 of 9
6. (take_image satellite1 planet13 instrument1 thermograph3)
   added: (have_image planet13 thermograph3)
   goals met: 1 of 9
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 9
8. (calibrate satellite0 instrument0 star10)
   added: (calibrated instrument0)
   goals met: 1 of 9
9. (turn_to satellite0 planet12 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet12)
   goals met: 1 of 9
10. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 2 of 9
11. (turn_to satellite0 planet14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet14)
   goals met: 2 of 9
12. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 3 of 9
13. (turn_to satellite0 planet18 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet18)
   goals met: 3 of 9
14. (take_image satellite0 planet18 instrument0 image1)
   added: (have_image planet18 image1)
   goals met: 4 of 9
15. (turn_to satellite0 star16 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star16)
   goals met: 4 of 9
16. (take_image satellite0 star16 instrument0 thermograph0)
   added: (have_image star16 thermograph0)
   goals met: 5 of 9
17. (turn_to satellite0 star17 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star17)
   goals met: 5 of 9
18. (take_image satellite0 star17 instrument0 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 6 of 9
19. (turn_to satellite0 planet13 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 planet13)
   goals met: 7 of 9
20. (turn_to satellite1 planet15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet15)
   goals met: 7 of 9
21. (take_image satellite1 planet15 instrument1 thermograph3)
   added: (have_image planet15 thermograph3)
   goals met: 8 of 9
22. (turn_to satellite3 groundstation8 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation8)
   goals met: 9 of 9
